interface LessonInfo {
    name: string;
    no: number;
    iframeUrl: string,
    description: LessonDescription;
    simulation: SimulationDescription;
    question: Question;
}

export interface LessonDescription {
    titleNo: string;
    title: string;
    subject: string;
    objectives: string[];
}

export interface Hypothesis {
    hypothesis: string;
    question: string;
    upText: string;
    downText: string;
    moreText?: string;
}

export interface Variable {
    variables: string[];
    dependents: string[];
}

export interface Question {
    hypos: Hypothesis[];
    vairable: Variable;
    definition: string;
}

export interface SimulationDescription {
    situation: string;
    description: string;
    procedures: string[];
    summaries: string[];
}

export const LESSONS: { [no: string]: LessonInfo } = {
    "1": {
        name: "pH ของสารละลาย",
        no: 1,
        iframeUrl: "https://phet.colorado.edu/sims/html/ph-scale/latest/ph-scale_all.html?locale=th",
        description: {
            titleNo: "หน่วยการเรียนรู้ที่ 10",
            title: 'กรด-เบส',
            subject: 'เรื่อง pH ของสารละลาย',
            objectives: [
                'อธิบายความสัมพันธ์ระหว่าง pH กับความเข้มข้นของไฮโดรเนียมไอออนได้ (K)',
                'อธิบายความเป็นกรด-เบสของสารละลายเมื่อทราบค่า pH ได้ (K)',
                'ปฏิบัติการทดลองจากสถานการณ์จำลองเสมือนจริง โดยตรวจสอบค่า pH ของสารละลายเมื่อทราบความเข้มข้นของไฮโดรเนียมไอออนหรือความเข้มข้นของไฮดรอกไซด์ไอออนได้ (P)'
            ],
        },
        simulation: {
            situation: "การศึกษาค่า pH ของสารละลายผ่าน PhET Simulation",
            description: "ให้นักเรียนศึกษาและทดลองเกี่ยวกับการวัดค่า pH ของสารละลายประเภทต่าง ๆ โดยการสังเกตผลของการเปลี่ยนแปลงความเข้มข้นของไฮโดรเนียมไอออน (H₃O⁺) และไฮดรอกไซด์ไอออน (OH⁻)  ที่เกิดขึ้นในสารละลายทั้งกรดและเบส",
            procedures: [
                "เริ่มจากการเลือกสารละลายหนึ่งอย่างจาก สารละลายทั้งหมด 12 ชนิด จากนั้นวัดค่า pH ของสารละลายนั้น",
                "นักเรียนเจือจางสารละลายกรดหรือเบสด้วยการเติมน้ำเข้าไปในสารละลายแล้วสังเกตการเปลี่ยนแปลงของค่า pH และสีของสารละลายที่เกิดขึ้น",
                "สังเกตการเปลี่ยนแปลงของความเข้มข้นระหว่าง H₃O⁺ และ OH⁻ เมื่อสารละลายถูกเจือจางและวัดค่า pH อีกครั้ง"
            ],
            summaries: [
                "นักเรียนบันทึกค่า pH ของสารละลายแต่ละชนิดก่อนและหลังการเจือจาง",
                "นักเรียนอธิบายการเปลี่ยนแปลงของค่า pH จากผลการทดลองและตั้งข้อสังเกตเกี่ยวกับการที่สารละลายกรดหรือเบสจะมีค่า pH เปลี่ยนแปลงเมื่อเจือจาง",
            ]
        },
        question: {
            hypos: [
                {
                    hypothesis: "หากความเข้มข้นของของสารละลายไฮโดรเนียมไอออนเพิ่มขึ้น",
                    question: " ค่า pH จะ",
                    upText: "เพิ่มขึ้น",
                    downText: "ลดลง",
                },
                {
                    hypothesis: "หากความเข้มข้นของของสารละลายไฮดรอกไซด์ไอออนเพิ่มขึ้น",
                    question: " ค่า pOH จะ ",
                    upText: "เพิ่มขึ้น",
                    downText: "ลดลง",
                }
            ],
            vairable: {
                variables: ["ความเข้มข้นของของสารละลายไฮโดรเนียมไอออน", "ค่า pH ของสารละลาย"],
                dependents: ["ความเข้มข้นของของสารละลายไฮโดรเนียมไอออน", "ค่า pH ของสารละลาย"]
            },
            definition: "pH ของสารละลาย คือ"
        }
    },
    "2": {
        name: "การไทเทรต กรด-เบส",
        no: 2,
        iframeUrl: "https://phet.colorado.edu/sims/html/ph-scale/latest/ph-scale_all.html?locale=th",
        description: {
            titleNo: "หน่วยการเรียนรู้ที่ 10",
            title: 'กรด-เบส',
            subject: 'เรื่อง การไทเทรต',
            objectives: [
                'อธิบายความหมายของการไทเทรต สารละลายมาตรฐาน และจุดสมมูลได้ (K)',
                'ปฏิบัติการทดลองจากสถานการณ์จำลองเสมือนจริง โดยการไทเทรตหาจุดยุติของปฏิกิริยาระหว่างกรดแก่กับเบสแก่ได้ (P)',
                'ปฏิบัติการทดลองจากสถานการณ์จำลองเสมือนจริง โดยคำนวณหาความเข้มข้นของกรดหรือเบสที่ทำปฏิกิริยาพอดีกัน โดยใช้ข้อมูลจากการไทเทรตได้ (P)'
            ],
        },
        simulation: {
            situation: "การหาความเข้มข้นของสารละลายจากการไทเทรตกรด-เบส โดยใช้อินดิเคเตอร์",
            description: "ให้นักเรียนศึกษาและทดลองเกี่ยวกับการหาความเข้มข้นของสารละลายจากการไทเทรตกรด-เบส โดยใช้อินดิเคเตอร์ โดยการหาปริมาตรของสารละลายเบสแก่ (สารที่บรรจุในบิวเรตต์) ที่ทำปฏิกิริยากับกรด (สารที่บรรจุในขวดรูปชมพู่)",
            procedures: [
                "ให้นักเรียนเลือกประเภทของสารที่ใช้ในการไทเทรต คือ “กรดแก่ - เบสแก่” บรรจุสารละลายเบสลงในบิวเรตต์",
                "เลือกสารละลายกรดไฮโดรคลอริก (HCl) และสารละลายโซเดียมไฮดรอกไซด์ (NaOH) เป็นสารที่ใช้ในการไทเทรต จากนั้นใช้ฟีนอล์ฟทาลีนเป็นอินดิเคเตอร์ในการไทเทรต",
                "ทำการไทเทรตจนกระทั้งถึงจุดยุติ บันทึกปริมาตรของ NaOH ที่ใช้",
                "คำนวณหาความเข้มข้นของสารละลาย"
            ],
            summaries: [
                "ขณะที่เติมสารละลายโซเดียมไฮดรอกไซด์ลงในกรดไฮโดรคลอริก pH ของสารละลายผสมมีการเปลี่ยนแปลงอย่าง่ไร",
                "ณ จุดยุติสารละลายโซเดียมไฮดรอกไซด์ที่ใช้มีปริมาตรเท่าใด",
            ]
        },
        question: {
            hypos: [{
                hypothesis: "หากกรดที่ใช้ในการไทเทรตมีความเข้มข้นสูง (จำนวนโมลของกรดในสารละลายสูง)",
                question: " จะต้องใช้ปริมาณเบสในการไทเทรตที่",
                upText: "มากขึ้น",
                downText: "ลดลง",
                moreText: "จึงจะสามารถทำปฏิกิริยาพอดีกัน (สมมูลกัน)"
            }],
            vairable: {
                variables: ["ความเข้มข้นของสารละลายกรดไฮโดรคลอริก", "ปริมาตรของสารละลายโซเดียมไฮดรอกไซด์"],
                dependents: ["ความเข้มข้นของสารละลายกรดไฮโดรคลอริก", "ปริมาตรของสารละลายโซเดียมไฮดรอกไซด์"]
            },
            definition: "การไทเทรต คือ"
        }
    },
    "3": {
        name: "ปฏิกิริยารีดอกซ์",
        no: 3,
        iframeUrl: "https://teachchemistry.org/simulations/2021/may/#/",
        description: {
            titleNo: "หน่วยการเรียนรู้ที่ 10",
            title: 'กรด-เบส',
            subject: 'เรื่อง ปฏิกิริยารีดอกซ์',
            objectives: [
                "วิเคราะห์การเปลี่ยนแปลงเลขออกซิเดชัน และระบุตัวรีดิวซ์และตัวออกซิไดส์ รวมทั้งเขียนครึ่งปฏิกิริยาออกซิเดชันและครึ่งปฏิกิริยารีดักชันของปฏิกิริยารีดอกซ์ (K)",
                "ปฏิบัติการทดลองจากสถานการณ์จำลองเสมือนจริง โดยทดลองเปรียบเทียบความสามารถในการเป็นตัวรีดิวซ์หรือตัวออกซิไดส์ และเขียนแสดงปฏิกิริยารีดอกซ์ (P)"
            ],
        },
        simulation: {
            situation: "การศึกษาการเกิดปฏิกิริยารีดอกซ์ระหว่างโลหะกับไอออนของโลหะ",
            description: "ให้นักเรียนศึกษาและทดลองเกี่ยวกับการเกิดปฏิกิริยารีดอกซ์ระหว่างโลหะกับไอออนของโลหะ โดยเปรียบเทียบความสามารถในการเป็นตัวรีดิวซ์ของโลหะ และตัวออกซิไดส์ของไอออนของโลหะ",
            procedures: [
                "ต่อเซลล์ไฟฟ้าระหว่าง Silver (Ag) ใน AgNO₃ (aq) กับ Copper (Cu) ใน  Cu(NO₃)₂ (aq)",
                "การสังเกตผลการถ่ายโอนอิเล็กตรอนในแต่ละบีกเกอร์ และค่าศักไฟฟ้าของเซลล์ (E<sup>0</sup><sub>cell</sub>) ",
                "ทำซ้ำข้อที่ 1-2 แต่เปลี่ยนชนิดของขั้วไฟฟ้าและสารละลายอิเล็กโทรไลต์ ดังนี้",
                "\tSilver (Ag) ใน AgNO₃ (aq) และ Zinc (Zn) ใน Zn(NO₃)₂ (aq)",
                "\tCopper (Cu) ใน Cu(NO₃)₂ (aq) และ Zinc (Zn) ใน Zn(NO₃)₂ (aq)",
                "เปรียบเทียบผลของการถ่ายโอนอิเล็กตรอนของโลหะและไอออนทั้งสาม (Ag, Cu, Zn)"
            ],
            summaries: [
                "จงอธิบายความสัมพันธ์ของค่าศักย์ไฟฟ้ารีดักชัน (E⁰ᵣ) ของโลหะ และ ไอออนของโลหะกับ ความสามารถในการเป็นตัวรีดิวซ์ และความสามารถในการเป็นตัวออกซิไดส์"
            ]
        },
        question: {
            hypos: [
                {
                    hypothesis: "สารที่มีค่าศักย์ไฟฟ้ารีดักชัน (E⁰ᵣ) สูง",
                    question: "จะทำหน้าที่ในการ",
                    upText: "ให้อิเล็กตรอน",
                    downText: "รับอิเล็กตรอน",
                },
                {
                    hypothesis: "สารที่มีค่าศักย์ไฟฟ้ารีดักชัน (E⁰ᵣ) สูง",
                    question: "จะทำหน้าที่เป็น",
                    upText: "ตัวรีดิวซ์",
                    downText: "ตัวออกซิไดส์",
                },
                {
                    hypothesis: "สารที่มีค่าศักย์ไฟฟ้ารีดักชัน (E⁰ᵣ) ต่ำ",
                    question: "จะทำหน้าที่ในการ",
                    upText: "ให้อิเล็กตรอน",
                    downText: "รับอิเล็กตรอน",
                },
                {
                    hypothesis: "สารที่มีค่าศักย์ไฟฟ้ารีดักชัน (E⁰ᵣ) ต่ำ",
                    question: "จะทำหน้าที่เป็น",
                    upText: "ตัวรีดิวซ์",
                    downText: "ตัวออกซิไดส์",
                }
            ],
            vairable: {
                variables: ["ค่าศักย์ไฟฟ้ารีดักชัน (E⁰ᵣ)", "ความสามารถในการรับอิเล็กตรอน"],
                dependents: ["ค่าศักย์ไฟฟ้ารีดักชัน (E⁰ᵣ)", "ความสามารถในการรับอิเล็กตรอน"]
            },
            definition: "ปฏิกิริยารีดอกซ์ คือ"
        }
    }
}