interface LessonInfo {
    name: string;
    no: number;
    iframeUrl: string,
    description?: LessonDescription;
    simulation?: SimulationDescription;
}

export interface LessonDescription {
    titleNo: string;
    title: string;
    subject: string;
    objectives: string[];
}


export interface SimulationDescription {
    situation: string;
    description: string;
    procedures: string[];
    summaries: string[];
}

export const LESSONS: { [no: string]: LessonInfo } = {
    "1": {
        name: "pH ของสารละลาย",
        no: 1,
        iframeUrl: "https://phet.colorado.edu/sims/html/ph-scale/latest/ph-scale_all.html?locale=th",
        description: {
            titleNo: "หน่วยการเรียนรู้ที่ 10",
            title: 'กรด-เบส',
            subject: 'เรื่อง pH ของสารละลาย',
            objectives: [
                'อธิบายความสัมพันธ์ระหว่าง pH กับความเข้มข้นของไฮโดรเนียมไอออนได้ (K)',
                'อธิบายความเป็นกรด-เบสของสารละลายเมื่อทราบค่า pH ได้ (K)',
                'ปฏิบัติการทดลองจากสถานการณ์จำลองเสมือนจริง โดยตรวจสอบค่า pH ของสารละลายเมื่อทราบความเข้มข้นของไฮโดรเนียมไอออนหรือความเข้มข้นของไฮดรอกไซด์ไอออนได้ (P)'
            ],
        },
        simulation: {
            situation: "การศึกษาค่า pH ของสารละลายผ่าน PhET Simulation",
            description: "ให้นักเรียนศึกษาและทดลองเกี่ยวกับการวัดค่า pH ของสารละลายประเภทต่าง ๆ โดยการสังเกตผลของการเปลี่ยนแปลงความเข้มข้นของไฮโดรเนียมไอออน (H3O+) และไฮดรอกไซด์ไอออน (OH-)  ที่เกิดขึ้นในสารละลายทั้งกรดและเบส",
            procedures: [
                "เริ่มจากการเลือกสารละลายหนึ่งอย่างจาก สารละลายทั้งหมด 12 ชนิด จากนั้นวัดค่า pH ของสารละลายนั้น",
                "นักเรียนเจือจางสารละลายกรดหรือเบสด้วยการเติมน้ำเข้าไปในสารละลายแล้วสังเกตการเปลี่ยนแปลงของค่า pH และสีของสารละลายที่เกิดขึ้น",
                "สังเกตการเปลี่ยนแปลงของความเข้มข้นระหว่าง H3O+ และ OH- เมื่อสารละลายถูกเจือจางและวัดค่า pH อีกครั้ง"
            ],
            summaries: [
                "นักเรียนบันทึกค่า pH ของสารละลายแต่ละชนิดก่อนและหลังการเจือจาง",
                "นักเรียนอธิบายการเปลี่ยนแปลงของค่า pH จากผลการทดลองและตั้งข้อสังเกตเกี่ยวกับการที่สารละลายกรดหรือเบสจะมีค่า pH เปลี่ยนแปลงเมื่อเจือจาง",
            ]
        }
    },
    "2": {
        name: "การไทเทรต กรด-เบส",
        no: 2,
        iframeUrl: "https://phet.colorado.edu/sims/html/ph-scale/latest/ph-scale_all.html?locale=th",
        description: {
            titleNo: "หน่วยการเรียนรู้ที่ 10",
            title: 'กรด-เบส',
            subject: 'การไทเทรต',
            objectives: [
                'อธิบายความหมายของการไทเทรต สารละลายมาตรฐาน และจุดสมมูลได้ (K)',
                'ปฏิบัติการทดลองจากสถานการณ์จำลองเสมือนจริง โดยการไทเทรตหาจุดยุติของปฏิกิริยาระหว่างกรดแก่กับเบสแก่ได้ (P)',
                'ปฏิบัติการทดลองจากสถานการณ์จำลองเสมือนจริง โดยคำนวณหาความเข้มข้นของกรดหรือเบสที่ทำปฏิกิริยาพอดีกัน โดยใช้ข้อมูลจากการไทเทรตได้ (P)'
            ],
        },
        simulation: {
            situation: "การหาความเข้มข้นของสารละลายจากการไทเทรตกรด-เบส โดยใช้อินดิเคเตอร์",
            description: "ให้นักเรียนศึกษาและทดลองเกี่ยวกับการหาความเข้มข้นของสารละลายจากการไทเทรตกรด-เบส โดยใช้อินดิเคเตอร์ โดยการหาปริมาตรของสารละลายเบสแก่ (สารที่บรรจุในบิวเรตต์) ที่ทำปฏิกิริยากับกรด (สารที่บรรจุในขวดรูปชมพู่)",
            procedures: [
                "ให้นักเรียนเลือกประเภทของสารที่ใช้ในการไทเทรต คือ “กรดแก่ - เบสแก่” บรรจุสารละลายเบสลงในบิวเรตต์",
                "เลือกสารละลายกรดไฮโดรคลอริก (HCl) และสารละลายโซเดียมไฮดรอกไซด์ (NaOH) เป็นสารที่ใช้ในการไทเทรต จากนั้นใช้ฟีนอล์ฟทาลีนเป็นอินดิเคเตอร์ในการไทเทรต",
                "ทำการไทเทรตจนกระทั้งถึงจุดยุติ บันทึกปริมาตรของ NaOH ที่ใช้",
                "คำนวณหาความเข้มข้นของสารละลาย"
            ],
            summaries: [
                "ขณะที่เติมสารละลายโซเดียมไฮดรอกไซด์ลงในกรดไฮโดรคลอริก pH ของสารละลายผสมมีการเปลี่ยนแปลงอย่าง่ไร",
                "ณ จุดยติสารละลายโซเดียมไฮดรอกไซด์ที่ใช้มีปริมาตรเท่าใด",
            ]
        }
    },
    "3": {
        name: "ปฏิกิริยารีดอกซ์",
        no: 3,
        iframeUrl: "https://teachchemistry.org/simulations/2021/may/#/",
    }
}