interface LessonInfo {
    name: string;
    no: number;
    iframeUrl: string,
    description: LessonDescription;
    simulation: SimulationDescription;

    // This will be retreived in the backend
    question: Question;
    experimentQuestion: ExperimentQuestion[];
    summaryQuestion?: SummaryQuestion;
}

export interface SummaryQuestion {
    questionId?: number;
    answer?: string | null;
}

export interface ExperimentQuestion {
    questionId?: number;

    group: number | null
    question: string;
    moreText?: string | null;
    textRow?: number | null;

    answer?: string | null;
}

export interface LessonDescription {
    titleNo: string;
    title: string;
    subject: string;
    objectives: string[];
}

export interface Hypothesis {
    questionId?: number;
    answer?: string | null;
}

export interface Variable {
    varQuestionId?: number;
    depQuestionId?: number;

    variables: string[];
    dependents: string[];

    varAnswer?: string | null;
    depAnswer?: string | null;
}

export interface Question {
    hypo: Hypothesis;
    vairable: Variable;

    definitions: Definition[];


    controlVariableQuestionId?: number;
    controlVariableAnswer?: string | null;
}

export interface SimulationDescription {
    situation: string;
    description: string;
    procedures: string[];
    objective: ExperimentObjective;
}

export interface ExperimentObjective {
    objectives: string[];
    instruments: string[];
    chemicals: string[];
}

export interface Definition {
    definitionQuestionId?: number;
    definition: string;
    definitionAnswer?: string | null;
}

export const LESSONS: { [no: string]: LessonInfo } = {
    "1": {
        name: "pH ของสารละลาย",
        no: 1,
        iframeUrl: "https://phet.colorado.edu/sims/html/ph-scale/latest/ph-scale_all.html?locale=th",
        description: {
            titleNo: "หน่วยการเรียนรู้ที่ 10",
            title: 'กรด-เบส',
            subject: 'เรื่อง pH ของสารละลาย',
            objectives: [
                'อธิบายความสัมพันธ์ระหว่างค่า pH กับความเข้มข้นของไฮโดรเนียมไอออนได้ (K)',
                'อธิบายความเป็นกรด-เบสของสารละลายเมื่อทราบค่า pH ได้ (K)',
                'ปฏิบัติการทดลองจากสถานการณ์จำลองเสมือนจริง โดยตรวจสอบค่า pH ของสารละลายเมื่อทราบความเข้มข้นของไฮโดรเนียมไอออนหรือความเข้มข้นของไฮดรอกไซด์ไอออนได้ (P)',
                'สามารถตั้งสมมติฐาน กำหนดตัวแปร และคำนิยามเชิงปฏิบัติการได้ (P)',
                'มีส่วนร่วมในชั้นเรียน (A)'
            ],
        },
        simulation: {
            situation: "การศึกษาค่า pH ของสารละลายผ่าน PhET Simulation",
            description: "ให้นักเรียนศึกษาและทดลองเกี่ยวกับการวัดค่า pH ของสารละลายประเภทต่าง ๆ โดยการสังเกตผลของการเปลี่ยนแปลงความเข้มข้นของไฮโดรเนียมไอออน (H₃O⁺) และไฮดรอกไซด์ไอออน (OH⁻)  ที่เกิดขึ้นในสารละลายทั้งกรดและเบส",
            procedures: [
                "เริ่มจากการเลือกสารละลายหนึ่งอย่างจาก สารละลายทั้งหมด 12 ชนิด จากนั้นวัดค่า pH ของสารละลายนั้น",
                "นักเรียนเจือจางสารละลายกรดหรือเบสด้วยการเติมน้ำเข้าไปในสารละลายแล้วสังเกตการเปลี่ยนแปลงของค่า pH และสีของสารละลายที่เกิดขึ้น",
                "สังเกตการเปลี่ยนแปลงของความเข้มข้นระหว่าง H₃O⁺ และ OH⁻ เมื่อสารละลายถูกเจือจางและวัดค่า pH อีกครั้ง"
            ],
            objective: {
                objectives: ["ทดลองเพื่ออธิบายความสัมพันธ์ระหว่างค่า pH กับความเข้มข้นของไฮโดรเนียมไอออน"],
                instruments: ["บีกเกอร์", "pH Meter"],
                chemicals: ["น้ำกลั่น", "สารที่มีสมบัติเป็นกลาง", "สารที่มีสมบัติเป็นกรด", "สารที่มีสมบัติเป็นเบส"]
            }
        },
        question: {
            hypo: {},
            vairable: {
                variables: ["ความเข้มข้นของของสารละลายไฮโดรเนียมไอออน", "ค่า pH ของสารละลาย"],
                dependents: ["ความเข้มข้นของของสารละลายไฮโดรเนียมไอออน", "ค่า pH ของสารละลาย"]
            },
            definitions: []
        },
        experimentQuestion: [
            {
                question: "หากใช้สารละลายกรด เช่น กรดเกลือ (HCl) ในการทดลอง การเจือจางจะมีผลอย่างไรกับค่า pH",
                group: 1
            },
            {
                question: "หากใช้สารละลายเบส เช่น โซดาไฟ (NaOH) ในการทดลอง การเจือจางจะมีผลอย่างไรกับค่า pH",
                group: 2,
            },
            {
                question: "ทำไมการเจือจางกรดหรือเบสด้วยน้ำทำให้ค่า pH ของสารละลายมีค่าที่เข้าใกล้ 7",
                group: 3
            },
            {
                question: "เมื่อค่า [H₃O⁺] เพิ่มขึ้น (เลื่อนขึ้น) ค่า pH จะเป็นอย่างไร?",
                group: 4
            },
            {
                question: "เมื่อค่า [OH⁻] ลดลง (เลื่อนลง) ค่า pH จะเป็นอย่างไร?",
                group: 5
            },
            {
                question: "เมื่อคำนวณหาความสัมพันธ์ของ [H₃O⁺] x [OH⁻] จะได้ว่าความสัมพันธ์ของ [H₃O⁺] x [OH⁻] มีค่าเท่าไร?",
                group: 6
            }
        ]
    },
    "2": {
        name: "การไทเทรต",
        no: 2,
        iframeUrl: "https://phet.colorado.edu/sims/html/ph-scale/latest/ph-scale_all.html?locale=th",
        description: {
            titleNo: "หน่วยการเรียนรู้ที่ 10",
            title: 'กรด-เบส',
            subject: 'เรื่อง การไทเทรต',
            objectives: [
                'อธิบายความหมายของการไทเทรต สารละลายมาตรฐาน และจุดสมมูลได้ (K)',
                'ปฏิบัติการทดลองจากสถานการณ์จำลองเสมือนจริง โดยการไทเทรตหาจุดยุติของปฏิกิริยาระหว่างกรดแก่กับเบสแก่ได้ (P)',
                'ปฏิบัติการทดลองจากสถานการณ์จำลองเสมือนจริง โดยคำนวณหาความเข้มข้นของกรดหรือเบสที่ทำปฏิกิริยาพอดีกัน โดยใช้ข้อมูลจากการไทเทรตได้ (P)',
                'สามารถตั้งสมมติฐาน กำหนดตัวแปร คำนิยามเชิงปฏิบัติการ ได้ (P)',
                'มีส่วนร่วมในชั้นเรียน (A)',
            ],
        },
        simulation: {
            situation: "การหาความเข้มข้นของสารละลายจากการไทเทรตกรด-เบส โดยใช้อินดิเคเตอร์",
            description: "ให้นักเรียนศึกษาและทดลองเกี่ยวกับการหาความเข้มข้นของสารละลายจากการไทเทรตกรด-เบส โดยใช้อินดิเคเตอร์ โดยการหาปริมาตรของสารละลายเบสแก่ (สารที่บรรจุในบิวเรตต์) ที่ทำปฏิกิริยากับกรด (สารที่บรรจุในขวดรูปชมพู่)",
            procedures: [
                'ให้นักเรียนเลือกประเภทของสารที่ใช้ในการไทเทรต คือ "กรดแก่ - เบสแก่" บรรจุสารละลายเบสลงในบิวเรตต์',
                "เลือกสารละลายกรดไฮโดรคลอริก (HCl) และสารละลายโซเดียมไฮดรอกไซด์ (NaOH) เป็นสารที่ใช้ในการไทเทรต จากนั้นใช้ฟีนอล์ฟทาลีนเป็นอินดิเคเตอร์ในการไทเทรต",
                "ทำการไทเทรตจนกระทั้งถึงจุดยุติ บันทึกปริมาตรของ NaOH ที่ใช้",
                "คำนวณหาความเข้มข้นของสารละลาย"
            ],
            objective: {
                objectives: [
                    "ทดลองเพื่อหาความเข้มข้นของสารละลายจากการไทเทรตกรด-เบส โดยใช้อินดิเคเตอร์บอกจุดยุติ",
                    "คำนวณความเข้มข้นของสารละลายตัวอย่าง"
                ],
                instruments: ["บิวเรตต์", "ขวดรูปกรวย", "ปิเปตต์", "หลอดหยด", "กรวยกรอง", "ขาตั้งพร้อมที่จับ", "ลูกยางปิเปตต์", "ขวดน้ำกลั่น"],
                chemicals: ["สารละลายมาตรฐานโซเดียมไฮดรอกไซด์", "สารละลายไฮโดรคลอริก", "อินดิเคเตอร์ (เมทิลเรด, โบรโมไทมอลบลู, ฟีนอล์ฟทาลีน)"]
            }
        },
        question: {
            hypo: {},
            vairable: {
                variables: ["ความเข้มข้นของสารละลายกรดไฮโดรคลอริก", "ปริมาตรของสารละลายโซเดียมไฮดรอกไซด์"],
                dependents: ["ความเข้มข้นของสารละลายกรดไฮโดรคลอริก", "ปริมาตรของสารละลายโซเดียมไฮดรอกไซด์"]
            },
            definitions: []
        },
        experimentQuestion: [
            {
                question: "จากการทดลองการไทเทรตสารละลายกรดไฮโดรคลอริก (HCl) ด้วยสารละลายมาตรฐานโซเดียมไฮดรอกไซด์ (NaOH) โดยใช้ฟีนอล์ฟทาลีนเป็นอินดิเคเตอร์ นักเรียนทราบได้อย่างไรว่าถึงจุดยุติ",
                group: 1
            },
            {
                question: "นักเรียนใช้ NaOH ปริมาตร (มิลลิลิตร)",
                group: 2,
                textRow: 1
            },
            {
                question: "โดยสามารถคำนวณหาความเข้มข้นของ HCl ได้เท่ากับ",
                group: 2,
                textRow: 1
            }
        ]
    },
    "3": {
        name: "ปฏิกิริยารีดอกซ์",
        no: 3,
        iframeUrl: "https://teachchemistry.org/simulations/2021/may/#/",
        description: {
            titleNo: "หน่วยการเรียนรู้ที่ 11",
            title: 'เคมีไฟฟ้า',
            subject: 'เรื่อง ปฏิกิริยารีดอกซ์',
            objectives: [
                "วิเคราะห์การเปลี่ยนแปลงเลขออกซิเดชัน และระบุตัวรีดิวซ์และตัวออกซิไดส์ รวมทั้งเขียนครึ่งปฏิกิริยาออกซิเดชันและครึ่งปฏิกิริยารีดักชันของปฏิกิริยารีดอกซ์ (K)",
                "ปฏิบัติการทดลองจากสถานการณ์จำลองเสมือนจริง โดยทดลองเปรียบเทียบความสามารถในการเป็นตัวรีดิวซ์หรือตัวออกซิไดส์ และเขียนแสดงปฏิกิริยารีดอกซ์ (P)",
                "ปฏิบัติการทดลองจากสถานการณ์จำลองเสมือนจริง โดยทดลองเปรียบเทียบความสามารถในการเป็นตัวรีดิวซ์หรือตัวออกซิไดส์ และเขียนแสดงปฏิกิริยารีดอกซ์ (P)ในการเป็นตัวรีดิวซ์หรือตัวออกซิไดส์ (P)",
                "สามารถตั้งสมมติฐาน กำหนดตัวแปร และคำนิยามเชิงปฏิบัติการได้ (P)",
                "มีส่วนร่วมในชั้นเรียน (A)"
            ],
        },
        simulation: {
            situation: "การศึกษาการเกิดปฏิกิริยารีดอกซ์ระหว่างโลหะกับไอออนของโลหะ",
            description: "ให้นักเรียนศึกษาและทดลองเกี่ยวกับการเกิดปฏิกิริยารีดอกซ์ระหว่างโลหะกับไอออนของโลหะ โดยเปรียบเทียบความสามารถในการเป็นตัวรีดิวซ์ของโลหะ และตัวออกซิไดส์ของไอออนของโลหะ ",
            procedures: [
                "ต่อเซลล์ไฟฟ้าระหว่าง Silver (Ag) ใน AgNO₃ (aq) กับ Copper (Cu) ใน  Cu(NO₃)₂ (aq)",
                "การสังเกตผลการถ่ายโอนอิเล็กตรอนในแต่ละบีกเกอร์ และค่าศักไฟฟ้าของเซลล์ (E<sup>0</sup><sub>cell</sub>) ",
                "ทำซ้ำข้อที่ 1-2 แต่เปลี่ยนชนิดของขั้วไฟฟ้าและสารละลายอิเล็กโทรไลต์ ดังนี้",
                "\tSilver (Ag) ใน AgNO₃ (aq) และ Zinc (Zn) ใน Zn(NO₃)₂ (aq)",
                "\tCopper (Cu) ใน Cu(NO₃)₂ (aq) และ Zinc (Zn) ใน Zn(NO₃)₂ (aq)",
                "เปรียบเทียบผลของการถ่ายโอนอิเล็กตรอนของโลหะและไอออนทั้งสาม (Ag, Cu, Zn)"
            ],

            objective: {
                objectives: [
                    "ทดลองการเกิดปฏิกิริยารีดอกซ์",
                    "อธิบายการเปลี่ยนแปลงที่เกิดขึ้นจากการถ่ายโอนอิเล็กตรอนของปฏิกิริยารีดอกซ์ระหว่างโลหะกับไอออนของโลหะ"
                ],
                instruments: ["บีกเกอร์", "กระบอกตวง", "กระดาษทราย", "โวลต์มิเตอร์"],
                chemicals: ["แผ่นโลหะเงิน", "แผ่นโลหะทองแดง", "แผ่นโลหะสังกะสี", "สารละลายซิลเวอร์ไนเตรต", "สารละลายคอปเปอร์(II)ซัลเฟต", "สารละลายซิงค์(II)ซัลเฟต"]
            }
        },
        question: {
            hypo: {},
            vairable: {
                variables: ["ค่าศักย์ไฟฟ้ารีดักชัน (E⁰ᵣ)", "ความสามารถในการรับอิเล็กตรอน"],
                dependents: ["ค่าศักย์ไฟฟ้ารีดักชัน (E⁰ᵣ)", "ความสามารถในการรับอิเล็กตรอน"]
            },
            definitions: []
        },
        experimentQuestion: [
            {
                question: "สารที่เป็นตัวรีดิวซ์และออกซิไดส์ของแต่ละปฏิกิริยาคืออะไร",
                group: 1
            },
            {
                question: "เรียงลำดับความสามารถในการเป็นตัวรีดิวซ์ของโลหะ",
                group: 2
            },
            {
                question: "เรียงลำดับความสามารถในการเป็นตัวออกซิไดส์ของไอออนของโลหะ",
                group: 3
            }
        ]
    }
}